Revit 2020 API
ImageView.Create Method (Document, String)
 Create an ImageView containing an image imported from disk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2020 and will be removed in the next version of Revit. We suggest you instead use the Create method that takes ImageTypeOptions as input.")]
public static ImageView Create(
	Document document,
	string imageFileName
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2020 and will be removed in the next version of Revit. We suggest you instead use the Create method that takes ImageTypeOptions as input.")> _
Public Shared Function Create ( _
	document As Document, _
	imageFileName As String _
) As ImageView
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2020 and will be removed in the next version of Revit. We suggest you instead use the Create method that takes ImageTypeOptions as input.")]
public:
static ImageView^ Create(
	Document^ document,
	String^ imageFileName
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which to create the view.
imageFileName
Type: System.String
 The full path to the image file.
Return Value
 The newly created view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.FileArgumentNotFoundException |  The given imageFileName does not exist.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ImageView Class
Create Overload
Autodesk.Revit.DB Namespace